cask_args appdir: "/Applications"

# Tap Homebrew
tap "homebrew/bundle"

cask "visual-studio-code"

brew "git"
brew "hub"
brew "tig"
brew "vim"
brew "exa"

# Ops
brew "ansible"
brew "docker-compose"
brew "ssh-copy-id"
brew "cloudflared"
brew "awscli"

# Kubernetes
brew "kubectl"
brew "kubectx"
brew "k9s"
brew "krew"
brew "helm"

# Dev
brew "jq"
brew "go"
brew "mysql-client"
brew "node"

# Magento 2
brew "composer"
tap "davidalger/warden"
brew "warden"

# App store
mas "Microsoft Remote Desktop", id: 1295203466
mas "Mindnode", id: 1289197285
mas "Fantastical", id: 975937182
mas "Home Assistant", id: 1099568401
mas "1Password 7", id: 1333542190
mas "Magnet", id: 441258766
mas "Todoist", id: 585829637
mas "Table Tool", id: 1122008420
mas "Slack", id: 803453959